In [1]:
# BASIC SQL PROJECT USING PYTHON (GOOGLE COLAB)

import sqlite3

# Create in-memory database
conn = sqlite3.connect(":memory:")
cursor = conn.cursor()

# Create table
cursor.execute("""
CREATE TABLE Students (
    Roll_No INTEGER PRIMARY KEY,
    Name TEXT,
    Marks INTEGER,
    Section TEXT
)
""")

# Insert data
students_data = [
    (1, 'Arnab', 85, 'A'),
    (2, 'Sauda', 78, 'A'),
    (3, 'Turjo', 92, 'B'),
    (4, 'Rafi', 67, 'B'),
    (5, 'Mita', 88, 'A'),
    (6, 'Sohan', 95, 'B')
]

cursor.executemany("INSERT INTO Students VALUES (?, ?, ?, ?)", students_data)
conn.commit()

print("----- ALL STUDENTS -----")
cursor.execute("SELECT * FROM Students")
for row in cursor.fetchall():
    print(row)

print("\n----- STUDENTS WITH MARKS > 80 -----")
cursor.execute("SELECT Name, Marks FROM Students WHERE Marks > 80")
for row in cursor.fetchall():
    print(row)

print("\n----- STUDENTS FROM SECTION A -----")
cursor.execute("SELECT * FROM Students WHERE Section = 'A'")
for row in cursor.fetchall():
    print(row)

print("\n----- MAXIMUM MARKS -----")
cursor.execute("SELECT MAX(Marks) FROM Students")
print("Highest Marks:", cursor.fetchone()[0])

print("\n----- MINIMUM MARKS -----")
cursor.execute("SELECT MIN(Marks) FROM Students")
print("Lowest Marks:", cursor.fetchone()[0])

print("\n----- STUDENT WITH HIGHEST MARKS -----")
cursor.execute("""
SELECT Name, Marks
FROM Students
WHERE Marks = (SELECT MAX(Marks) FROM Students)
""")
for row in cursor.fetchall():
    print(row)

# Close connection
conn.close()

----- ALL STUDENTS -----
(1, 'Arnab', 85, 'A')
(2, 'Sauda', 78, 'A')
(3, 'Turjo', 92, 'B')
(4, 'Rafi', 67, 'B')
(5, 'Mita', 88, 'A')
(6, 'Sohan', 95, 'B')

----- STUDENTS WITH MARKS > 80 -----
('Arnab', 85)
('Turjo', 92)
('Mita', 88)
('Sohan', 95)

----- STUDENTS FROM SECTION A -----
(1, 'Arnab', 85, 'A')
(2, 'Sauda', 78, 'A')
(5, 'Mita', 88, 'A')

----- MAXIMUM MARKS -----
Highest Marks: 95

----- MINIMUM MARKS -----
Lowest Marks: 67

----- STUDENT WITH HIGHEST MARKS -----
('Sohan', 95)